app/views/posts/index.html.erb

    <%= post.content %>  <br>
    <%= User.find(post.user_id).name %>  <br>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]